toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
    static void Run() {
        for (;;) {
            // Wait until we're signalled
            _Scheduler::Wait([] { return (bool)_State || _Flash; });
            
            // Consume new state
            const std::optional<_LED::State> state = _State;
            const bool flash = _Flash;
            _State = std::nullopt;
            _Flash = false;
            
            // Handle state/flash
            if (state) _LED::StateSet(*state);
            if (flash) _LED::Flash();
        }
    }
    
    static void Set(Priority pri, std::optional<_LED::State> state) {
        _States[pri] = state;
        
        // Update _State
        // By default, turn the LEDs off, unless there's an alternative state requested
        _State = 0;
        for (std::optional<_LED::State> s : _States) {
            if (s) {
                _State = s;
                break;
            }
        }
    }
    
    static void Flash() {
        _Flash = true;
    }
    
    static inline std::optional<_LED::State> _States[_PriorityCount];
    static inline std::optional<_LED::State> _State;
    static inline bool _Flash = false;
    
    // Task stack
    SchedulerStack(".stack._TaskLED")
    static inline uint8_t Stack[128];
};








// MARK: - _TaskPower

#define _TaskPowerStackSize 128

SchedulerStack(".stack._TaskPower")
uint8_t _TaskPowerStack[_TaskPowerStackSize];

asm(".global _StartupStack");
asm(".equ _StartupStack, _TaskPowerStack+" Stringify(_TaskPowerStackSize));

struct _TaskPower {
    static void Run() {
        // Disable interrupts because _Init() and _Wired require it
        Toastbox::IntState ints(false);
        
        _Init();
        
        for (;;) {
            // Wait until something triggers us to update
            _Scheduler::Wait([] { return _Wired()!=_WiredMonitor::Wired() || _BatteryLevelUpdate; });
            
            // Update our wired state
            _Wired(_WiredMonitor::Wired());
            
            if (_BatteryLevelUpdate) {
                // Update our battery level
                _BatteryLevelSet(_BatterySampler::Sample());
                
                // Update our state
                _RTCCounter = _BatterySampleIntervalRTC;
                _CaptureCounter = _BatterySampleIntervalCapture;
                _BatteryLevelUpdate = false;
            }
        }
    }
    
    static MSP::BatteryLevelMv BatteryLevelGet() {
        return _BatteryLevel;
    }
    
    static void BatteryLevelUpdate() {
        _BatteryLevelUpdate = true;
    }
    
    static void BatteryLevelWait() {
        _Scheduler::Wait([] { return !_BatteryLevelUpdate; });
    }
    
    static bool On() { return _On(); }
    static void On(bool x) { _On(x); }
    static bool Wired() { return _Wired(); }
    static bool BatteryTrap() { return _BatteryTrap(); }
    
    static void CaptureNotify() {
        // Short-circuit if we're in battery trap
        // We don't want to monitor the battery while we're in battery trap, to minimize battery use
        if (_BatteryTrap()) return;
        _CaptureCounter--; // Rollover OK since we reset _CaptureCounter in Run()
        if (!_CaptureCounter) {
            BatteryLevelUpdate();
            BatteryLevelWait();
        }
    }
    
    static bool ISRRTC() {
        // Short-circuit if we're in battery trap
        // We don't want to monitor the battery while we're in battery trap, to minimize battery use
        if (_BatteryTrap()) return false;
        
        _RTCCounter--; // Rollover OK since we reset _RTCCounter in Run()
        if (!_RTCCounter) {
            BatteryLevelUpdate();
            return true;
        }
        return false;
    }
    
    static void VDDBEnabled(bool en) {
        _Pin::VDD_B_EN::Write(en);
        // Rails take ~1.5ms to turn on/off, so wait 2ms to be sure
        _Scheduler::Sleep(_Scheduler::Ms<2>);
    }
    
    static void VDDIMGSDEnabled(bool en) {
        if (en) {
            _Pin::VDD_B_2V8_IMG_SD_EN::Write(1);
            _Scheduler::Sleep(_Scheduler::Us<100>); // 100us delay needed between power on of VAA (2V8) and VDD_IO (1V8)
            _Pin::VDD_B_1V8_IMG_SD_EN::Write(1);
            
            // Rails take ~1ms to turn on, so wait 2ms to be sure
            _Scheduler::Sleep(_Scheduler::Ms<2>);
        
        } else {
            // No delay between 2V8/1V8 needed for power down (per AR0330CS datasheet)
            _Pin::VDD_B_2V8_IMG_SD_EN::Write(0);
            _Pin::VDD_B_1V8_IMG_SD_EN::Write(0);
            // Rails take ~1.5ms to turn off, so wait 2ms to be sure
            _Scheduler::Sleep(_Scheduler::Ms<2>);
        }
    }
    
    // _Init(): initialize system
    //
    // Ints: disabled
    //   Rationale: GPIO::Init() and _RTC::Init() require it, and in general we don't want
    //   interrupts to fire while we configure our other subsystems
    static void _Init() {
        // Init watchdog first
        _Watchdog::Init();
        
        // Init GPIOs
        GPIO::Init<
            // Power control
            _Pin::VDD_B_EN,
            _Pin::VDD_B_1V8_IMG_SD_EN,
            _Pin::VDD_B_2V8_IMG_SD_EN,
            
            // Clock (config chosen by _Clock)
            _Clock::Pin::XIN,
            _Clock::Pin::XOUT,
            
            // SPI (config chosen by _SPI)
            _SPI::Pin::Clk,
            _SPI::Pin::DataOut,
            _SPI::Pin::DataIn,
            
            // I2C (config chosen by _I2C)
            _I2C::Pin::SCL,
            _I2C::Pin::SDA,
            
            // Motion (config chosen by _Motion)
            _Motion::Pin::Power,
            _Motion::Pin::Signal,
            
            // Battery (config chosen by _BatterySampler)
            _BatterySampler::Pin::BatChrgLvl,
            _BatterySampler::Pin::BatChrgLvlEn,
            
            // Button (config chosen by _Button)
            _Button::Pin,
            
            // Wired
            _WiredMonitor::Pin,
            
            // LEDs
            _LED::Pin::Select,
            _LED::Pin::Signal
        
        >(Startup::ColdStart());
        
        // Init clock
        _Clock::Init();
        
//        _Pin::LED_RED_::Write(1);
//        for (;;) {
//            _Pin::LED_RED_::Write(1);
//            __delay_cycles(1000000);
//            _Pin::LED_RED_::Write(0);
//            __delay_cycles(1000000);
//        }
        
//        _Pin::LED_RED_::Write(1);
//        _Pin::LED_GREEN_::Write(1);
//        for (;;) {
//            _Pin::LED_RED_::Write(0);
//            __delay_cycles(1000000);
//            _Pin::LED_RED_::Write(1);
//            __delay_cycles(1000000);
//        }
        
//        _Pin::LED_RED_::Write(1);
//        _Pin::LED_GREEN_::Write(1);
//        for (;;) {
//            _Pin::LED_RED_::Write(0);
////            __delay_cycles(1000000);
//            _Scheduler::Delay(_Scheduler::Ms<100>);
//            _Pin::LED_RED_::Write(1);
////            __delay_cycles(1000000);
//            _Scheduler::Delay(_Scheduler::Ms<100>);
//        }
        
        // Init RTC
        // We need RTC to be unconditionally enabled for 2 reasons:
        //   - We want to track relative time (ie system uptime) even if we don't know the wall time.
        //   - RTC must be enabled to keep BAKMEM alive when sleeping. If RTC is disabled, we enter
        //     LPM4.5 when we sleep (instead of LPM3.5), and BAKMEM is lost.
        _RTC::Init();
        
        // Init BatterySampler
        _BatterySampler::Init();
        
