toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
        case Cmd::Op::ChargeStatusSet: {
            _ChargeStatus = cmd.arg.ChargeStatusSet.status;
            resp.ok = true;
            break;
        }
        
        case Cmd::Op::TimeGet:
            resp = MSP::Resp{
                .ok = true,
                .arg = { .TimeGet = { .state = _RTC::TimeState() } },
            };
            break;
        
        case Cmd::Op::TimeSet:
            // Only allow setting the time while we're in host mode
            // and therefore _TaskEvent isn't running
            if (!_HostModeEnabled) break;
            _RTC::Init(&cmd.arg.TimeSet.state);
            resp.ok = true;
            break;
        
        case Cmd::Op::TimeAdjust:
            // Only allow setting the time while we're in host mode
            // and therefore _TaskEvent isn't running
            if (!_HostModeEnabled) break;
            _RTC::Adjust(cmd.arg.TimeAdjust.adjustment);
            resp.ok = true;
            break;
        
        case Cmd::Op::HostModeSet:
            _HostModeEnabled = cmd.arg.HostModeSet.en;
            resp.ok = true;
            break;
        
        case Cmd::Op::VDDIMGSDSet:
            if (!_HostModeEnabled) break;
            _TaskPower::VDDIMGSDEnabled(cmd.arg.VDDIMGSDSet.en);
            resp.ok = true;
            break;
        }
        
        return resp;
    }
    
    static bool HostModeEnabled() {
        return _HostModeEnabled;
    }
    
    static std::optional<_LED::State> _LEDStateForChargeStatus(MSP::ChargeStatus x) {
        switch (x) {
        case MSP::ChargeStatus::Underway: return _LED::StateRed;
        case MSP::ChargeStatus::Complete: return _LED::StateGreen;
        default: return std::nullopt;
        }
    }
    
    static void _ChargeStatusChanged() {
        _TaskLED::Set(_TaskLED::PriorityChargeState, _LEDStateForChargeStatus(_ChargeStatus));
    }
    
    static void _HostModeEnabledChanged() {
        if (_HostModeEnabled) {
            _TaskLED::Set(_TaskLED::PriorityHostMode, _LED::StateRed | _LED::StateGreen | _LED::StateFlickerFast);
        } else {
            _TaskLED::Set(_TaskLED::PriorityHostMode, std::nullopt);
            
            // Turn off power when exiting host mode
            _TaskPower::VDDIMGSDEnabled(false);
        }
    }
    
    static inline T_Property<bool,_HostModeEnabledChanged,_EventsEnabledUpdate> _HostModeEnabled;
    static inline T_Property<MSP::ChargeStatus,_ChargeStatusChanged> _ChargeStatus;
    
    // Task stack
    SchedulerStack(".stack._TaskI2C")
    static inline uint8_t Stack[256];
};

// MARK: - _TaskSD

//static void debugSignal() {
//    _Pin::DEBUG_OUT::Init();
//    for (;;) {
////    for (int i=0; i<10; i++) {
//        _Pin::DEBUG_OUT::Write(0);
//        for (volatile int i=0; i<10000; i++);
//        _Pin::DEBUG_OUT::Write(1);
//        for (volatile int i=0; i<10000; i++);
//    }
//}

struct _TaskSD {
    static void Reset() {
        // Reset our state
        _State = {};
    }
    
    static void CardReset() {
        Wait();
        _Scheduler::Start<_TaskSD>([] { _CardReset(); });
    }
    
    static void CardInit() {
        Wait();
        _Scheduler::Start<_TaskSD>([] { _CardInit(); });
    }
    
    static void Write(uint8_t srcRAMBlock) {
        Wait();
        _State.writing = true;
        
        static struct { uint8_t srcRAMBlock; } Args;
        Args = { srcRAMBlock };
        _Scheduler::Start<_TaskSD>([] { _Write(Args.srcRAMBlock); });
    }
    
    static void Wait() {
        _Scheduler::Wait<_TaskSD>();
    }
    
    // SDStateReady(): returns whether we're done initializing _State.sd
    static bool SDStateReady() {
        return (bool)_State.rca;
    }
    
    static bool Writing() {
        return _State.writing;
    }
    
//    static void WaitForInit() {
//        _Scheduler::Wait([&] { return _RCA.has_value(); });
//    }
    
    static void _CardReset() {
        _SDCard::Reset();
    }
    
    static void _CardInit() {
        if (!_State.rca) {
            // We haven't successfully enabled the SD card since _TaskSD::Reset();
            // enable the SD card and get the card id / card data.
            SD::CardId cardId;
            SD::CardData cardData;
            _State.rca = _SDCard::Init(&cardId, &cardData);
            
            // If SD state isn't valid, or the existing SD card id doesn't match the current
            // card id, reset the SD state.
            if (!::_State.sd.valid || memcmp(&::_State.sd.cardId, &cardId, sizeof(cardId))) {
                _SDStateInit(cardId, cardData);
            
            // Otherwise the SD state is valid and the SD card id matches, so init the ring buffers.
            } else {
                _ImgRingBufInit();
            }
        
        } else {
            // We've previously enabled the SD card successfully since _TaskSD::Reset();
            // enable it again
            _SDCard::Init();
        }
    }
    
    static void _Write(uint8_t srcRAMBlock) {
        const MSP::ImgRingBuf& imgRingBuf = ::_State.sd.imgRingBufs[0];
        
        // Copy full-size image from RAM -> SD card
        {
            const SD::Block block = MSP::SDBlockFull(::_State.sd.baseFull, imgRingBuf.buf.idx);
            _SDCard::WriteImage(*_State.rca, srcRAMBlock, block, Img::Size::Full);
        }
        
        // Copy thumbnail from RAM -> SD card
        {
            const SD::Block block = MSP::SDBlockThumb(::_State.sd.baseThumb, imgRingBuf.buf.idx);
            _SDCard::WriteImage(*_State.rca, srcRAMBlock, block, Img::Size::Thumb);
        }
        
        _ImgRingBufIncrement();
        _State.writing = false;
    }
    
    // _SDStateInit(): resets the _State.sd struct
    static void _SDStateInit(const SD::CardId& cardId, const SD::CardData& cardData) {
        using namespace MSP;
        // CombinedBlockCount: thumbnail block count + full-size block count
        constexpr uint32_t CombinedBlockCount = ImgSD::Thumb::ImageBlockCount + ImgSD::Full::ImageBlockCount;
        // blockCap: the capacity of the SD card in SD blocks (1 block == 512 bytes)
        const uint32_t blockCap = ((uint32_t)GetBits<69,48>(cardData)+1) * (uint32_t)1024;
        // imgCap: the capacity of the SD card in number of images
        const uint32_t imgCap = blockCap / CombinedBlockCount;
        
        FRAMWriteEn writeEn; // Enable FRAM writing
        
        // Mark the _State as invalid in case we lose power in the middle of modifying it
        ::_State.sd.valid = false;
        std::atomic_signal_fence(std::memory_order_seq_cst);
        
        // Set .cardId
        {
            ::_State.sd.cardId = cardId;
        }
        
        // Set .imgCap
        {
            ::_State.sd.imgCap = imgCap;
        }
        
        // Set .baseFull / .baseThumb
        {
            ::_State.sd.baseFull = imgCap * ImgSD::Full::ImageBlockCount;
            ::_State.sd.baseThumb = ::_State.sd.baseFull + imgCap * ImgSD::Thumb::ImageBlockCount;
        }
        
