toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
    // Task stack
    SchedulerStack(".stack._TaskImg")
    static inline uint8_t Stack[256];
};

// MARK: - _TaskEvent

struct _TaskEvent {
    static void Start() {
        _Scheduler::Start<_TaskEvent>();
    }
    
    static void Reset() {
        // Reset our timer
        _EventTimer::Schedule(std::nullopt);
        // Reset other tasks' state
        // This is necessary because we're stopping them at an arbitrary point
        _TaskSD::Reset();
        _TaskImg::Reset();
        // Stop tasks
        _Scheduler::Stop<_TaskSD, _TaskImg, _TaskEvent>();
        // Turn off power
        _TaskPower::VDDIMGSDEnabled(false);
        _TaskPower::VDDBEnabled(false);
        // Reset our state
        // We do this last so that our power assertions are reset last
        _State = {};
    }
    
    static bool ISRRTC() {
        return _EventTimer::ISRRTC();
    }
    
    static bool ISRTimer(uint16_t iv) {
        return _EventTimer::ISRTimer(iv);
    }
    
    static void _TimeTrigger(_Triggers::TimeTriggerEvent& ev) {
        _Triggers::TimeTrigger& trigger = ev.trigger();
        // Schedule the CaptureImageEvent, but only if we're not in fast-forward mode
        if (_State.live) CaptureStart(trigger, ev.time);
        // Reschedule TimeTriggerEvent for its next trigger time
        EventInsert(ev, ev.repeat);
    }
    
    static void _MotionEnablePower(_Triggers::MotionEnablePowerEvent& ev) {
        _Triggers::MotionTrigger& trigger = (_Triggers::MotionTrigger&)ev;
        // Power on motion sensor
        trigger.stateUpdate(_Triggers::MotionTrigger::StatePowerEnable);
    }
    
    static void _MotionEnable(_Triggers::MotionEnableEvent& ev) {
        _Triggers::MotionTrigger& trigger = ev.trigger();
        
        // Power on the motion sensor, because it may not be powered already, because the very
        // first MotionEnableEvent doesn't have a corresponding MotionEnablePowerEvent, because we
        // schedule the MotionEnablePowerEvent as a result of the MotionEnableEvent, below.
        trigger.stateUpdate(
            _Triggers::MotionTrigger::StatePowerEnable|_Triggers::MotionTrigger::StateMotionEnable,
            _Triggers::MotionTrigger::StateMaxImageCount
        );
        trigger.countRem = trigger.base().count;
        
        // Schedule the MotionDisableEvent, if applicable.
        // This needs to happen before we reschedule `ev` because we need its .time to
        // properly schedule the MotionDisableEvent!
        const uint32_t durationTicks = trigger.base().durationTicks;
        if (durationTicks) {
            EventInsert(_Cast<_Triggers::MotionDisableEvent&>(trigger), _TimeInstantAdd(ev.time, durationTicks));
        }
        
        // Reschedule MotionEnableEvent for its next trigger time
        const bool repeat = EventInsert(ev, ev.repeat);
        
        // Schedule MotionEnablePowerEvent event `PowerOnDelayMs` before the MotionEnableEvent.
        if (repeat) {
            EventInsert(_Cast<_Triggers::MotionEnablePowerEvent>(trigger),
                _TimeInstantSubtract(ev.time, _TicksForMs(_Motion::PowerOnDelayMs)));
        }
    }
    
    static void _MotionDisable(_Triggers::MotionDisableEvent& ev) {
        _Triggers::MotionTrigger& trigger = (_Triggers::MotionTrigger&)ev;
        // Disable power / motion
        trigger.stateUpdate(
            0,
            _Triggers::MotionTrigger::StatePowerEnable|_Triggers::MotionTrigger::StateMotionEnable
        );
    }
    
    static void _MotionUnsuppressPower(_Triggers::MotionUnsuppressPowerEvent& ev) {
        _Triggers::MotionTrigger& trigger = (_Triggers::MotionTrigger&)ev;
        // Unsuppress motion power
        trigger.stateUpdate(
            0,
            _Triggers::MotionTrigger::StatePowerSuppress
        );
    }
    
    static void _MotionUnsuppress(_Triggers::MotionUnsuppressEvent& ev) {
        _Triggers::MotionTrigger& trigger = (_Triggers::MotionTrigger&)ev;
        // Unsuppress motion
        trigger.stateUpdate(
            0,
            _Triggers::MotionTrigger::StateMotionSuppress
        );
    }
    
    static void _CaptureImage(_Triggers::CaptureImageEvent& ev) {
        // We should never get a CaptureImageEvent event while in fast-forward mode
        Assert(_State.live);
        
        constexpr MSP::ImgRingBuf& imgRingBuf = ::_State.sd.imgRingBufs[0];
        
        // Notify _TaskPower that we're performing a capture, and wait for it to sample the battery if it decided to.
        // We do this here because we want the battery sampling to complete before we turn on VDDB / VDDIMGSD and start
        // capturing an image, so that we sample the voltage while the system is quiet, instead of when the system is
        // bursting with activity, which causes lots of noise on the battery line.
        _TaskPower::CaptureNotify();
        
        if (ev.capture->ledFlash) {
            _TaskLED::Flash();
        }
        
        // Turn on VDD_B power (turns on ICE40)
        _TaskPower::VDDBEnabled(true);
        
        // Wait for ICE40 to start
        // We specify (within the bitstream itself, via icepack) that ICE40 should load
        // the bitstream at high-frequency (40 MHz).
        // According to the datasheet, this takes 70ms.
        _Scheduler::Sleep(_Scheduler::Ms<30>);
        _ICEInit();
        
        // Reset SD nets before we turn on SD power
        _TaskSD::CardReset();
        _TaskSD::Wait();
        
        // Turn on IMG/SD power
        _TaskPower::VDDIMGSDEnabled(true);
        
        // Init image sensor / SD card
        _TaskImg::SensorInit();
        _TaskSD::CardInit();
        
        // Capture an image
        {
            // Wait until _TaskSD has initialized _State.sd (since we're about to refer to
            // _State.sd.imgRingBufs), and for any previous writing to be complete (because
            // the SDRAM is single-port, so we can't write an image to RAM until we're done
            // copying an image from RAM -> SD card).
            _Scheduler::Wait([] { return _TaskSD::SDStateReady() && !_TaskSD::Writing(); });
            
