toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
            // Capture image to RAM
            _TaskImg::Capture(imgRingBuf.buf.id);
            const uint8_t srcRAMBlock = _TaskImg::CaptureBlock();
             
            // Copy image from RAM -> SD card
            _TaskSD::Write(srcRAMBlock);
            _TaskSD::Wait();
        }
        
        _TaskPower::VDDIMGSDEnabled(false);
        _TaskPower::VDDBEnabled(false);
        
        ev.countRem--;
        if (ev.countRem) {
            EventInsert(ev, _TimeInstantAdd(ev.time, ev.capture->delayTicks));
        }
    }
    
    static void EventInsert(_Triggers::Event& ev, const Time::Instant& time) {
        _Triggers::EventInsert(ev, time);
        // If this event is now the front of the list, reschedule _EventTimer
        if (_Triggers::EventFront() == &ev) {
            _EventTimerSchedule();
        }
    }
    
    static bool EventInsert(_Triggers::Event& ev, MSP::Repeat& repeat) {
        const Time::Ticks32 delta = _RepeatAdvance(repeat);
        // delta=0 means Repeat=never, in which case we don't reschedule the event
        if (delta) {
            EventInsert(ev, _TimeInstantAdd(ev.time, delta));
            return true;
        }
        return false;
    }
    
//    static void EventInsert(_Triggers::Event& ev, const Time::Instant& time, Time::Ticks32 deltaTicks) {
//        EventInsert(ev, time + deltaTicks);
//    }
    
    static bool CaptureStart(_Triggers::CaptureImageEvent& ev, const Time::Instant& time) {
        // Bail if the CaptureImageEvent is already underway
        if (ev.countRem) return false;
        
        // Reset capture count
        ev.countRem = ev.capture->count;
        if (ev.countRem) {
            EventInsert(ev, time);
        }
        return true;
    }
    
    static void _EventTimerSchedule() {
        // Short-circuit if we're fast-forwarding through events
        if (!_State.live) return;
        _Triggers::Event* ev = _Triggers::EventFront();
        std::optional<Time::Instant> time;
        if (ev) time = ev->time;
        _EventTimer::Schedule(time);
    }
    
    // _EventPop(): pops an event from the front of the list if it's ready to be handled
    // Interrupts must be disabled
    static _Triggers::Event& _EventPop() {
        _Triggers::Event* ev = _Triggers::EventFront();
        Assert(ev); // We must have an event at this point, or else we have a logic error
        _Triggers::EventPop();
        // Schedule _EventTimer for the next event
        _EventTimerSchedule();
        return *ev;
    }
    
    static void _EventHandle(_Triggers::Event& ev) {
        // Handle the event
        using T = _Triggers::Event::Type;
        switch (ev.type) {
        case T::TimeTrigger:
            _TimeTrigger(           _Cast<_Triggers::TimeTriggerEvent&>(ev)             ); break;
        case T::MotionEnablePower:
            _MotionEnablePower(     _Cast<_Triggers::MotionEnablePowerEvent&>(ev)       ); break;
        case T::MotionEnable:
            _MotionEnable(          _Cast<_Triggers::MotionEnableEvent&>(ev)            ); break;
        case T::MotionDisable:
            _MotionDisable(         _Cast<_Triggers::MotionDisableEvent&>(ev)           ); break;
        case T::MotionUnsuppressPower:
            _MotionUnsuppressPower( _Cast<_Triggers::MotionUnsuppressPowerEvent&>(ev)   ); break;
        case T::MotionUnsuppress:
            _MotionUnsuppress(      _Cast<_Triggers::MotionUnsuppressEvent&>(ev)        ); break;
        case T::CaptureImage:
            _CaptureImage(          _Cast<_Triggers::CaptureImageEvent&>(ev)            ); break;
        }
    }
    
    static void Run() {
        // Reset our state
        Reset();
        
        // Init SPI peripheral
        _SPI::Init();
        
        // Init Triggers
        const Time::Instant startTime = _RTC::Now();
        _Triggers::Init(startTime);
        
        // Fast-forward through events
        for (;;) {
            _Triggers::Event* ev = _Triggers::EventFront();
            if (!ev || (ev->time > startTime)) break;
            _EventHandle(_EventPop());
        }
        
        _State.live = true;
        
        // Schedule _EventTimer for the first event
        _EventTimerSchedule();
        
        for (;;) {
            // Wait for _EventTimer to fire
            _EventTimer::Wait();
            _EventHandle(_EventPop());
        }
    }
    
    // _EventTimer: timer that triggers us to wake when the next event is ready to be handled
    using _EventTimer = T_Timer<_Scheduler, _RTC, _ACLKFreqHz>;
    
    static inline struct __State {
        __State() {} // Compiler bug workaround
        // live=false while initializing, where we execute events in 'fast-forward' mode,
        // solely to arrive at the correct state for the current time.
        // live=true once we're done initializing and executing events normally.
        bool live = false;
    } _State;
    
    // Task stack
    SchedulerStack(".stack._TaskEvent")
    static inline uint8_t Stack[256];
};

// MARK: - _TaskButton

struct _TaskButton {
    static bool _ButtonInteractionAllowed() {
        // Allow button interaction if we're not in battery trap, or we're wired
        return !_TaskPower::BatteryTrap() || _TaskPower::Wired();
    }
    
    static void _ButtonHoldPrepare() {
        _TaskLED::Set(_TaskLED::PriorityButton, _LED::StateOff);
    }
    
    static void _ButtonHold() {
        _TaskPower::On(!_TaskPower::On());
        _TaskLED::Set(_TaskLED::PriorityButton, _TaskPower::On() ? _LED::StateGreen : _LED::StateRed);
    }
    
    static void _ButtonHoldCleanup() {
        _TaskLED::Set(_TaskLED::PriorityButton, _LED::StateOff);
        _Scheduler::Sleep(_Scheduler::Ms<1000>);
        _TaskLED::Set(_TaskLED::PriorityButton, std::nullopt);
    }
    
    static void _ButtonPress() {
        // Ignore button presses if events are disabled
        if (!_EventsEnabled) return;
        
        for (auto it=_Triggers::ButtonTriggerBegin(); it!=_Triggers::ButtonTriggerEnd(); it++) {
            _TaskEvent::CaptureStart(*it, _RTC::Now());
        }
    }
    
