toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
    static void Run() {
        // Disable interrupts because _Button requires it
        Toastbox::IntState ints(false);
        
        // Wait until button is released
        {
            _Button::ConfigUp();
            _Button::Wait();
        }
        
        for (;;) {
            // Wait until button is pressed
            {
                _Button::ConfigDown();
                _Button::Wait();
            }
            
            // Ignore button interaction if necessary
            if (!_ButtonInteractionAllowed()) continue;
            
            // Wait until button is released
            {
                _Button::ConfigUp();
                const bool up = _Button::Wait(_HoldShortDuration);
                if (up) {
                    _ButtonPress();
                    continue;
                }
            }
            
            // Wait until button is released
            {
                _ButtonHoldPrepare();
                const bool up = _Button::Wait(_HoldLongDuration);
                if (up) {
                    _ButtonPress();
                } else {
                    _ButtonHold();
                    // Wait until button is actually released
                    _Button::Wait();
                }
                _ButtonHoldCleanup();
            }
        }
    }
    
    static constexpr auto _HoldShortDuration = _Scheduler::Ms<300>;
    static constexpr auto _HoldLongDuration = _Scheduler::Ms<1100>;
    
    // Task stack
    SchedulerStack(".stack._TaskButton")
    static inline uint8_t Stack[128];
};

// MARK: - _TaskMotion

struct _TaskMotion {
    // _TaskMotion::Run() is a good size to put in the 'Information FRAM' section (a 512 byte section)
    // to free up some space for the regular FRAM section.
    [[gnu::section(".fram_info"), gnu::used]]
    static void Run() {
        // Disable interrupts because _Motion requires it
        Toastbox::IntState ints(false);
        
        for (;;) {
            // Wait for motion to be powered
            _Scheduler::Wait([] { return _Power; });
            
            // Power on motion sensor and wait for it to start up
            _Motion::Power(true);
            
            for (;;) {
                // Wait for motion, or for motion to be disabled
                _Motion::SignalReset();
                _Scheduler::Wait([] { return !_Power || _Motion::Signal(); });
                
                // When potentially disabling the motion sensor, institute a debounce to filter 1->0->1 glitches.
                // This is so we don't have to pay for the full motion-sensor power-on time (30s) for a momentary
                // glitch.
                // Such glitches can occur when we go from wired->unwired, since we power on the motion sensor
                // when we're wired. (We do this in case the device is reconfigured to enable the motion sensor,
                // so it's ready to go as soon as we're unwired, and we don't have to pay the 30s penalty.)
                if (!_Power) {
                    _Scheduler::Wait(_PowerOffDebounceDuration, [] { return _Power; });
                    if (_Power) continue;
                    else        break;
                }
                
                _HandleMotion();
            }
            
            // Turn off motion sensor
            _Motion::Power(false);
        }
    }
    
    static void Power(bool x) {
        _Power = x;
    }
    
    static void _HandleMotion() {
        // Ignore motion if events are disabled
        // This can happen if we're wired (and therefore motion is enabled),
        // but we're powered off.
        if (!_EventsEnabled) return;
        
        // When motion occurs, start captures for each enabled motion trigger
        for (auto it=_Triggers::MotionTriggerBegin(); it!=_Triggers::MotionTriggerEnd(); it++) {
            _Triggers::MotionTrigger& trigger = *it;
            
            // Check if we should ignore this trigger
            if (!trigger.enabled()) continue;
            
            // Start capture
            const Time::Instant time = _RTC::Now();
            const bool captureStarted = _TaskEvent::CaptureStart(trigger, time);
            // CaptureStart() returns false if a capture is already in progress for this trigger.
            // Short-circuit if that's the case.
            if (!captureStarted) continue;
            
            // Update the number of motion triggers remaining.
            // If this was the last trigger that we're allowed, set the `StateMaxImageCount` bit,
            // which will .
            if (trigger.countRem) {
                trigger.countRem--;
                if (!trigger.countRem) {
                    trigger.stateUpdate(_Triggers::MotionTrigger::StateMaxImageCount);
                }
            }
            
            // Suppress motion for the specified duration, if suppression is enabled
            const Time::Ticks32 suppressTicks = trigger.base().suppressTicks;
            if (suppressTicks) {
                // Suppress power/motion immediately
                trigger.stateUpdate(
                    _Triggers::MotionTrigger::StatePowerSuppress|_Triggers::MotionTrigger::StateMotionSuppress);
                
                // Schedule MotionUnsuppressEvent
                const Time::Instant unsuppressTime = _TimeInstantAdd(time, suppressTicks);
                _TaskEvent::EventInsert(_Cast<_Triggers::MotionUnsuppressEvent>(trigger), unsuppressTime);
                
                // Schedule MotionUnsuppressPowerEvent event `PowerOnDelayMs` before the MotionUnsuppressEvent.
                const Time::Instant prepareTime = _TimeInstantSubtract(unsuppressTime, _TicksForMs(_Motion::PowerOnDelayMs));
                _TaskEvent::EventInsert(_Cast<_Triggers::MotionUnsuppressPowerEvent>(trigger), prepareTime);
            }
        }
    }
    
    static constexpr auto _PowerOffDebounceDuration = _Scheduler::Ms<1000>;
    static inline bool _Power = false;
    
